cfd/base_case/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box (-0.070 -0.070 0.105) (0.070 0.070 0.135);

        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
);
